In [1]:
import pandas as pd
df = pd.read_csv("data/scores.csv")
df.head(3)

      name    kor    eng   math
0    Aiden  100.0   90.0   95.0
1  Charles   90.0   80.0   75.0
2   Danial   95.0  100.0  100.0

In [2]:
# 결측치 확인하기
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    30 non-null     object
 1   kor     27 non-null     float64
 2   eng     28 non-null     float64
 3   math    29 non-null     float64
dtypes: float64(3), object(1)
memory usage: 1.1+ KB

In [3]:
# 결측치가 있는 행 삭제
df.dropna(inplace=True)

In [5]:
# 결측치 확인
df.isnull().sum()

name    0
kor     0
eng     0
math    0
dtype: int64

In [6]:
# 등급을 매기기 위한 평균점수 컬럼 추가
df['avg']=round((df.kor+df.eng+df.math)/3,1)
df.head(2)

      name    kor   eng  math   avg
0    Aiden  100.0  90.0  95.0  95.0
1  Charles   90.0  80.0  75.0  81.7

In [7]:
# 평균점수에 따른 등급 컬럼 추가
def get_grade(x):
    if x>=90:
        return 1
    elif x>=80:
        return 2
    elif x>=70:
        return 3
    elif x>=60:
        return 4
    else:
        return 5

In [8]:
df['grade']=df['avg'].apply(get_grade)
df.head(3)

      name    kor    eng   math   avg  grade
0    Aiden  100.0   90.0   95.0  95.0      1
1  Charles   90.0   80.0   75.0  81.7      2
2   Danial   95.0  100.0  100.0  98.3      1

In [9]:
# 등급컬럼을 카테고리형 자료형으로 변환하기
# 자료형 확인하기
df.dtypes

name      object
kor      float64
eng      float64
math     float64
avg      float64
grade      int64
dtype: object

In [10]:
df['grade']=df['grade'].astype('category')
df.dtypes

name       object
kor       float64
eng       float64
math      float64
avg       float64
grade    category
dtype: object

In [11]:
# 카테고리 이름 바꾸기
df['grade'].cat.categories = ['A','B','C','D']
df.head(10)

       name    kor    eng   math    avg grade
0     Aiden  100.0   90.0   95.0   95.0     A
1   Charles   90.0   80.0   75.0   81.7     B
2    Danial   95.0  100.0  100.0   98.3     A
3      Evan  100.0  100.0  100.0  100.0     A
5       Ian   90.0  100.0   90.0   93.3     A
6     James   70.0   75.0   65.0   70.0     C
7    Julian   80.0   90.0   55.0   75.0     C
8    Justin   50.0   60.0  100.0   70.0     C
9     Kevin  100.0  100.0   90.0   96.7     A
10      Leo   90.0   95.0   70.0   85.0     B

In [12]:
# 누락된 카테고리 추가
df['grade']=df['grade'].cat.set_categories(['A','B','C','D','F'])
df['grade'].dtypes

CategoricalDtype(categories=['A', 'B', 'C', 'D', 'F'], ordered=False)

In [13]:
# 데이터 용량 확인하기
# titanic 데이터에서 카테고리형으로 관리할 수 있는 자료형을 카테고리형으로 변환하여 데이터 용량 비교하기
df_titanic = pd.read_csv("data/titanic.csv")
df_titanic.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [14]:
df_titanic['Survived'].unique()

array([0, 1], dtype=int64)

In [15]:
df_titanic['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [16]:
df_titanic['Sex'].unique()

array(['male', 'female'], dtype=object)

In [17]:
df_titanic['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [18]:
# 데이터타입
df_titanic.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [19]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     1309 non-null   int64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
dtypes: float64(2), int64(5), object(5)
memory usage: 122.8+ KB

In [21]:
# 카테고리형으로 바꾸기
df_titanic['Survived']=df_titanic['Survived'].astype('category')
df_titanic['Pclass']=df_titanic['Pclass'].astype('category')
df_titanic['Sex']=df_titanic['Sex'].astype('category')
df_titanic['Embarked']=df_titanic['Embarked'].astype('category')

In [22]:
df_titanic.dtypes

PassengerId       int64
Survived       category
Pclass         category
Name             object
Sex            category
Age             float64
SibSp             int64
Parch             int64
Ticket           object
Fare            float64
Cabin            object
Embarked       category
dtype: object

In [23]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     1309 non-null   category
 2   Pclass       1309 non-null   category
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   category
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   category
dtypes: category(4), float64(2), int64(3), object(3)
memory usage: 87.6+ KB